chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/int/processor/int_p32mx664f128l.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _INT_P32MX664F128L_H
#define _INT_P32MX664F128L_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    INT_ID_0 = 0,
    INT_NUMBER_OF_MODULES

} INT_MODULE_ID;

typedef enum {

    INT_EXTERNAL_INT_SOURCE0 = 0x01,
    INT_EXTERNAL_INT_SOURCE1 = 0x02,
    INT_EXTERNAL_INT_SOURCE2 = 0x04,
    INT_EXTERNAL_INT_SOURCE3 = 0x08,
    INT_EXTERNAL_INT_SOURCE4 = 0x10

} INT_EXTERNAL_SOURCES;

typedef enum {

    INT_DISABLE_INTERRUPT = 0,
    INT_PRIORITY_LEVEL1 = 1,
    INT_PRIORITY_LEVEL2 = 2,
    INT_PRIORITY_LEVEL3 = 3,
    INT_PRIORITY_LEVEL4 = 4,
    INT_PRIORITY_LEVEL5 = 5,
    INT_PRIORITY_LEVEL6 = 6,
    INT_PRIORITY_LEVEL7 = 7

} INT_PRIORITY_LEVEL;

typedef enum {

    INT_SUBPRIORITY_LEVEL0 = 0x00,
    INT_SUBPRIORITY_LEVEL1 = 0x01,
    INT_SUBPRIORITY_LEVEL2 = 0x02,
    INT_SUBPRIORITY_LEVEL3 = 0x03

} INT_SUBPRIORITY_LEVEL;

typedef enum {

    INT_SOURCE_TIMER_CORE = 0,
    INT_SOURCE_SOFTWARE_0 = 1,
    INT_SOURCE_SOFTWARE_1 = 2,
    INT_SOURCE_EXTERNAL_0 = 3,
    INT_SOURCE_TIMER_1 = 4,
    INT_SOURCE_INPUT_CAPTURE_1_ERROR = 61,
    INT_SOURCE_INPUT_CAPTURE_1 = 5,
    INT_SOURCE_OUTPUT_COMPARE_1 = 6,
    INT_SOURCE_EXTERNAL_1 = 7,
    INT_SOURCE_TIMER_2 = 8,
    INT_SOURCE_INPUT_CAPTURE_2_ERROR = 62,
    INT_SOURCE_INPUT_CAPTURE_2 = 9,
    INT_SOURCE_OUTPUT_COMPARE_2 = 10,
    INT_SOURCE_EXTERNAL_2 = 11,
    INT_SOURCE_TIMER_3 = 12,
    INT_SOURCE_INPUT_CAPTURE_3_ERROR = 63,
    INT_SOURCE_INPUT_CAPTURE_3 = 13,
    INT_SOURCE_OUTPUT_COMPARE_3 = 14,
    INT_SOURCE_EXTERNAL_3 = 15,
    INT_SOURCE_TIMER_4 = 16,
    INT_SOURCE_INPUT_CAPTURE_4_ERROR = 64,
    INT_SOURCE_INPUT_CAPTURE_4 = 17,
    INT_SOURCE_OUTPUT_COMPARE_4 = 18,
    INT_SOURCE_EXTERNAL_4 = 19,
    INT_SOURCE_TIMER_5 = 20,
    INT_SOURCE_INPUT_CAPTURE_5_ERROR = 65,
    INT_SOURCE_INPUT_CAPTURE_5 = 21,
    INT_SOURCE_OUTPUT_COMPARE_5 = 22,
    INT_SOURCE_ADC_1 = 33,
    INT_SOURCE_SPI_1_ERROR = 23,
    INT_SOURCE_SPI_1_RECEIVE = 24,
    INT_SOURCE_SPI_1_TRANSMIT = 25,
    INT_SOURCE_USART_1_ERROR = 26,
    INT_SOURCE_USART_1_RECEIVE = 27,
    INT_SOURCE_USART_1_TRANSMIT = 28,
    INT_SOURCE_I2C_1_ERROR = 29,
    INT_SOURCE_I2C_1_SLAVE = 30,
    INT_SOURCE_I2C_1_MASTER = 31,
    INT_SOURCE_CHANGE_NOTICE = 32,
    INT_SOURCE_PARALLEL_PORT = 34,
    INT_SOURCE_PARALLEL_PORT_ERROR = 66,
    INT_SOURCE_COMPARATOR_1 = 35,
    INT_SOURCE_COMPARATOR_2 = 36,
    INT_SOURCE_USB_1 = 57,
    INT_SOURCE_DMA_0 = 48,
    INT_SOURCE_DMA_1 = 49,
    INT_SOURCE_DMA_2 = 50,
    INT_SOURCE_DMA_3 = 51,
    INT_SOURCE_SPI_2_ERROR = 37,
    INT_SOURCE_SPI_2_RECEIVE = 38,
    INT_SOURCE_SPI_2_TRANSMIT = 39,
    INT_SOURCE_USART_2_ERROR = 40,
    INT_SOURCE_USART_2_RECEIVE = 41,
    INT_SOURCE_USART_2_TRANSMIT = 42,
    INT_SOURCE_I2C_2_ERROR = 43,
    INT_SOURCE_I2C_2_SLAVE = 44,
    INT_SOURCE_I2C_2_MASTER = 45,
    INT_SOURCE_ETH_1 = 60,
    INT_SOURCE_SPI_3_ERROR = 26,
    INT_SOURCE_SPI_3_RECEIVE = 27,
    INT_SOURCE_SPI_3_TRANSMIT = 28,
    INT_SOURCE_USART_3_ERROR = 37,
    INT_SOURCE_USART_3_RECEIVE = 38,
    INT_SOURCE_USART_3_TRANSMIT = 39,
    INT_SOURCE_I2C_3_ERROR = 26,
    INT_SOURCE_I2C_3_SLAVE = 27,
    INT_SOURCE_I2C_3_MASTER = 28,
    INT_SOURCE_SPI_4_ERROR = 40,
    INT_SOURCE_SPI_4_RECEIVE = 41,
    INT_SOURCE_SPI_4_TRANSMIT = 42,
    INT_SOURCE_USART_4_ERROR = 67,
    INT_SOURCE_USART_4_RECEIVE = 68,
    INT_SOURCE_USART_4_TRANSMIT = 69,
    INT_SOURCE_I2C_4_ERROR = 37,
    INT_SOURCE_I2C_4_SLAVE = 38,
    INT_SOURCE_I2C_5_MASTER = 42,
    INT_SOURCE_USART_5_ERROR = 73,
    INT_SOURCE_USART_5_RECEIVE = 74,
    INT_SOURCE_USART_5_TRANSMIT = 75,
    INT_SOURCE_I2C_5_SLAVE = 41,
    INT_SOURCE_USART_6_ERROR = 70,
    INT_SOURCE_USART_6_RECEIVE = 71,
    INT_SOURCE_USART_6_TRANSMIT = 72,
    INT_SOURCE_CLOCK_MONITOR = 46,
    INT_SOURCE_RTCC = 47,
    INT_SOURCE_FLASH_CONTROL = 56,
    INT_SOURCE_I2C_4_MASTER = 39,
    INT_SOURCE_I2C_5_ERROR = 40

} INT_SOURCE;

typedef enum {

    INT_VECTOR_CT = _CORE_TIMER_VECTOR,
    INT_VECTOR_CS0 = _CORE_SOFTWARE_0_VECTOR,
    INT_VECTOR_CS1 = _CORE_SOFTWARE_1_VECTOR,
    INT_VECTOR_INT0 = _EXTERNAL_0_VECTOR,
    INT_VECTOR_T1 = _TIMER_1_VECTOR,
    INT_VECTOR_IC1 = _INPUT_CAPTURE_1_VECTOR,
    INT_VECTOR_OC1 = _OUTPUT_COMPARE_1_VECTOR,
    INT_VECTOR_INT1 = _EXTERNAL_1_VECTOR,
    INT_VECTOR_T2 = _TIMER_2_VECTOR,
    INT_VECTOR_IC2 = _INPUT_CAPTURE_2_VECTOR,
    INT_VECTOR_OC2 = _OUTPUT_COMPARE_2_VECTOR,
    INT_VECTOR_INT2 = _EXTERNAL_2_VECTOR,
    INT_VECTOR_T3 = _TIMER_3_VECTOR,
    INT_VECTOR_IC3 = _INPUT_CAPTURE_3_VECTOR,
    INT_VECTOR_OC3 = _OUTPUT_COMPARE_3_VECTOR,
    INT_VECTOR_INT3 = _EXTERNAL_3_VECTOR,
    INT_VECTOR_T4 = _TIMER_4_VECTOR,
    INT_VECTOR_IC4 = _INPUT_CAPTURE_4_VECTOR,
    INT_VECTOR_OC4 = _OUTPUT_COMPARE_4_VECTOR,
    INT_VECTOR_INT4 = _EXTERNAL_4_VECTOR,
    INT_VECTOR_T5 = _TIMER_5_VECTOR,
    INT_VECTOR_IC5 = _INPUT_CAPTURE_5_VECTOR,
    INT_VECTOR_OC5 = _OUTPUT_COMPARE_5_VECTOR,
    INT_VECTOR_PMP = _PMP_VECTOR,
    INT_VECTOR_USB1 = _USB_1_VECTOR,
    INT_VECTOR_RTCC = _RTCC_VECTOR,
    INT_VECTOR_FLASH = _FCE_VECTOR,
    INT_VECTOR_SPI1 = _SPI_1_VECTOR,
    INT_VECTOR_UART1 = _UART_1_VECTOR,
    INT_VECTOR_SPI3 = _SPI_3_VECTOR,
    INT_VECTOR_I2C3 = _I2C_3_VECTOR,
    INT_VECTOR_I2C1 = _I2C_1_VECTOR,
    INT_VECTOR_CN = _CHANGE_NOTICE_VECTOR,
    INT_VECTOR_AD1 = _ADC_VECTOR,
    INT_VECTOR_CMP1 = _COMPARATOR_1_VECTOR,
    INT_VECTOR_CMP2 = _COMPARATOR_2_VECTOR,
    INT_VECTOR_UART3 = _UART_3_VECTOR,
    INT_VECTOR_SPI2 = _SPI_2_VECTOR,
    INT_VECTOR_I2C4 = _I2C_4_VECTOR,
    INT_VECTOR_UART2 = _UART_2_VECTOR,
    INT_VECTOR_SPI4 = _SPI_4_VECTOR,
    INT_VECTOR_I2C5 = _I2C_5_VECTOR,
    INT_VECTOR_I2C2 = _I2C_2_VECTOR,
    INT_VECTOR_FSCM = _FAIL_SAFE_MONITOR_VECTOR,
    INT_VECTOR_DMA0 = _DMA_0_VECTOR,
    INT_VECTOR_DMA1 = _DMA_1_VECTOR,
    INT_VECTOR_DMA2 = _DMA_2_VECTOR,
    INT_VECTOR_DMA3 = _DMA_3_VECTOR,
    INT_VECTOR_FCE = _FCE_VECTOR,
    INT_VECTOR_ETH = _ETH_VECTOR,
    INT_VECTOR_UART4 = _UART_4_VECTOR,
    INT_VECTOR_UART6 = _UART_6_VECTOR,
    INT_VECTOR_UART5 = _UART_5_VECTOR

